// Lab_03_1.cpp
// < Мельник Дар'я >
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 10
#include <iostream>
#include <cmath>
using namespace std;
int main()
{
	double x; // вхідний параметр
	double y; // результат обчислення виразу
	double A; // проміжний результат - функціонально стала частина виразу 
	double B; // проміжний результат - функціонально стала частина виразу

	cout << "x = "; cin >> x;

	A = 4.95 * (x * x);

	if (x < (-3.5)) // перша умова
		B = 4 + (1 / x * x);
	if ((-3.5) <= x < 1.0) // друга умова
		B = tan((3.5 + x) / 5);
	if (x >= 1.0) // третя умова
		B = sin(3 * x) - cos(x);
	y = A + B;
	cout << "y = " << y << endl;

	cin.get();
	return 0;
} 